//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

//5 -> 2, 4
//8 -> 2, 4, 6, 8

int count = 1;
int n = 3;


    
    int N = т
    int index = 0;
    int znach = 0;
    int countChet = (N / 2);

    while (index < countChet)
    {
        znach = znach + 2;
        Console.Write(znach);
        Console.Write(", ");
        index = index + 1;
    }
    if (index == 0) Console.Write("Четных чисел нет ");
    count = count + 1;
    Console.WriteLine();

		
	
